app/views/comments/_comment.html.erb

<p>
<strong> Posted <%= time_ago_in_words(comment.created_at)  %></stong> <br/>
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "hello"], ["created_at", Tue, 28 Oct 2014 18:47:35 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 28 Oct 2014 18:47:35 UTC +00:00]]