app/views/answers/_answer.html.erb

<p>
<strong> Posted <%= time_ago_in_words(answer.created_at)  %></stong> <br/>
---
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "heyy this is nice one :)"], ["created_at", "2014-10-28 20:14:56.672072"], ["question_id", 5], ["updated_at", "2014-10-28 20:14:56.672072"]]