app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "heyy this is nice one :)"], ["created_at", "2014-10-28 20:14:56.672072"], ["question_id", 5], ["updated_at", "2014-10-28 20:14:56.672072"]]