app/controllers/questions_controller.rb

INSERT INTO "questions" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "oakd;sk;da"], ["created_at", "2014-10-28 20:11:53.840791"], ["title", "aldkjladlsa"], ["updated_at", "2014-10-28 20:11:53.840791"]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save